Revit 2027 API
BuiltInFailures.AutoRouteFailures.FailedDowngradeTeeToCross Property
 Failed to upgrade tee type to cross type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FailedDowngradeTeeToCross { get; }
Public Shared ReadOnly Property FailedDowngradeTeeToCross As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FailedDowngradeTeeToCross {
	FailureDefinitionId^ get ();
}
static member FailedDowngradeTeeToCross : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AutoRouteFailures Class
Autodesk.Revit.DB Namespace